elua/elua/src/platform/stm32/platform.c
  /* Configure USART */
  USART_Init(usart[id], initVals);
  
  /* Enable USART1 Receive and Transmit interrupts */
  //USART_ITConfig(usart[id], USART_IT_RXNE, ENABLE);
  //USART_ITConfig(usart[id], USART_IT_TXE, ENABLE);

  /* Enable the USART1 */
  USART_Cmd(usart[id], ENABLE);
}

static void uarts_init()
{
  USART_InitTypeDef USART_InitStructure;

  // Enable clocks.
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
  
  // Configure the U(S)ART for 115,200, 8-N-1 operation.

  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

  usart_init(CONSOLE, &USART_InitStructure);
}

int platform_uart_exists( unsigned id )
{
  return id < UARTS_COUNT;
}

u32 platform_uart_setup( unsigned id, u32 baud, int databits, int parity, int stopbits )
{
  USART_InitTypeDef USART_InitStructure;

  USART_InitStructure.USART_BaudRate = baud;
  
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    
  switch( databits )
  {
    case 5:
    case 6:
    case 7:
    case 8:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;
      break;
    case 9:
      USART_InitStructure.USART_WordLength = USART_WordLength_9b;
      break;
    default:
      USART_InitStructure.USART_WordLength = USART_WordLength_8b;
      break;
  }

  switch (stopbits)
  {
    case PLATFORM_UART_STOPBITS_1:
      USART_InitStructure.USART_StopBits = USART_StopBits_1;
      break;
    case PLATFORM_UART_STOPBITS_2:
      USART_InitStructure.USART_StopBits = USART_StopBits_2;
      break;
    default:
      USART_InitStructure.USART_StopBits = USART_StopBits_2;
      break;
  }    

  switch (parity)
  {
    case PLATFORM_UART_PARITY_EVEN:
      USART_InitStructure.USART_Parity = USART_Parity_Even;
      break;
    case PLATFORM_UART_PARITY_ODD:
      USART_InitStructure.USART_Parity = USART_Parity_Odd;
      break;
    default:
      USART_InitStructure.USART_Parity = USART_Parity_No;
      break;
  }
  
  usart_init(id, &USART_InitStructure);
  
  return TRUE;
}

void platform_uart_send( unsigned id, u8 data )
{
  while(USART_GetFlagStatus(usart[id], USART_FLAG_TXE) == RESET)
  {
  }
  USART_SendData(usart[id], data);
}

int platform_uart_recv( unsigned id, unsigned timer_id, int timeout )
{
  timer_data_type tmr_start, tmr_crt;
  int res;
  
  if( timeout == 0 )
  {
    while(USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET)
    {
    }
//    if (USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET)
//    {
//      return -1;
//    }
    return USART_ReceiveData(usart[id]);  
  }
  else if( timeout == PLATFORM_UART_INFINITE_TIMEOUT )
  {
    // Receive char blocking
    while(USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET)
    {
    }
    return USART_ReceiveData(usart[id]);  
  }
  else
  {
    // Receive char blocking
    while(USART_GetFlagStatus(usart[id], USART_FLAG_RXNE) == RESET)
    {
    }
    return USART_ReceiveData(usart[id]);    
#if 0
    // Receive char with the specified timeout
    tmr_start = platform_timer_op( timer_id, PLATFORM_TIMER_OP_START, 0 );
    while( 1 )
    {
      if( ( res = UARTCharGetNonBlocking( base ) ) >= 0 )
        break;
      tmr_crt = platform_timer_op( timer_id, PLATFORM_TIMER_OP_READ, 0 );
      if( platform_timer_get_diff_us( timer_id, tmr_crt, tmr_start ) >= timeout )
        break;
    }
    return res;
#endif
  }
}
#endif

#ifdef STM32_USE_TIMERS
// ****************************************************************************
// Timers
// Same on LM3S8962 and LM3S6965

// All possible LM3S timers defs
static TIM_TypeDef * timer[] = { TIM2, TIM3, TIM4, TIM5};
#define TIMERS_COUNT			4

static void timers_init()
{
#if 0
  unsigned i;

  for( i = 0; i < TIMERS_COUNT; i ++ )
  {
	SysCtlPeripheralEnable(timer_sysctl[ i ]);
    TimerConfigure(timer_base[ i ], TIMER_CFG_32_BIT_PER);
    TimerEnable(timer_base[ i ], TIMER_A);
  }
#endif
}

static u32 platform_timer_get_clock(unsigned id)
{
  RCC_ClocksTypeDef Clocks;

  RCC_GetClocksFreq(&Clocks);

  return Clocks.PCLK1_Frequency / (TIM_GetPrescaler(timer[id]) + 1)
}

static u32 platform_timer_set_clock(unsigned id, u32 clock)
{
  RCC_ClocksTypeDef Clocks;
  u32 pclk, clkdiv;
  u64 tmp;

  RCC_GetClocksFreq(&Clocks);

  pclk   = Clocks.PCLK1_Frequency; // Get peripheral bus clock frequency.
  tmp    = ((u64)pclk << 16) / clock; // Convert to u32.16 fixed point and calculate prescaler divisor
  clkdiv = ((tmp & 0x8000) ? (tmp + 0x10000) : tmp) >> 16;  // Round up or down and convert back to u32.0
  if (clkdiv > 0x10000)  // Saturate to u16 (+1 for a clkdiv value of 1 is a reg value of 0)
      clkdiv = 0x10000;
  
  TIM_PrescalerConfig(timer[id], clkdiv - 1, TIM_PSCReloadMode_Immediate); // Update timer prescaler immediately
  
  return pclk / clkdiv; // Return actual clock rate used.
}

int platform_timer_exists( unsigned id )
{
  return id < TIMERS_COUNT;
}

void platform_timer_delay( unsigned id, u32 delay_us )
{
  timer_data_type final;
  u32 base = timer_base[ id ];
  
  final = 0xFFFFFFFF - ( ( ( u64 )delay_us * SysCtlClockGet() ) / 1000000 );
  TimerLoadSet( base, TIMER_A, 0xFFFFFFFF );
  while( TimerValueGet( base, TIMER_A ) > final );
}
      
u32 platform_timer_op( unsigned id, int op, u32 data )
{
  u32 res = 0;
  u32 base = timer_base[ id ]; 
  
  data = data;
  switch( op )
  {
    case PLATFORM_TIMER_OP_START:
      res = 0xFFFFFFFF;
      TimerLoadSet( base, TIMER_A, 0xFFFFFFFF );
      break;
      
    case PLATFORM_TIMER_OP_READ:
      res = TimerValueGet( base, TIMER_A );
      break;
      
